In [54]:
import pandas as pd
import numpy as np
from utils import get_relation

In [ ]:
get_relation()

In [45]:
df = pd.read_excel("test_data.xlsx")

In [47]:
df

,121_col1,121_col2,12m_col1,12m_col2,m2m_col1,m2m_col2,121_col1_int,121_col2_int
0,A1,A1,B1,B11,D1,D1,1,1.0
1,A2,A2,B1,B12,D2,D1,2,2.0
2,A2,A2,B1,B13,D3,D1,2,2.0
3,A3,NaN,B2,B21,D1,D2,3,NaN
4,A3,A3,B2,B21,D2,D2,3,3.0
5,A4,A4,B2,B22,D3,D2,4,4.0

In [48]:
col1 = "121_col1"
col2 = "121_col2"
print("gb col1", df[[col1, col2]].groupby(col1).nunique().max())
print("gb col2", df[[col1, col2]].groupby(col2).nunique().max())
print(get_relation(df, col1, col2), ' reversed ', get_relation(df, col2, col1))
print(get_relation(df, col1, col2, ignore_na=False), ' reversed ', get_relation(df, col2, col1, ignore_na=False))

gb col1 121_col2    1
dtype: int64
gb col2 121_col1    1
dtype: int64
one-to-one  reversed  one-to-one
one-to-many  reversed  many-to-one

In [49]:
col1 = "121_col1_int"
col2 = "121_col2_int"
print("gb col1", df[[col1, col2]].groupby(col1).nunique().max())
print("gb col2", df[[col1, col2]].groupby(col2).nunique().max())
print(get_relation(df, col1, col2), ' reversed ', get_relation(df, col2, col1))
print("use na", get_relation(df, col1, col2, ignore_na=False), ' reversed ', get_relation(df, col2, col1, ignore_na=False))

gb col1 121_col2_int    1
dtype: int64
gb col2 121_col1_int    1
dtype: int64
one-to-one  reversed  one-to-one
use na one-to-many  reversed  many-to-one

In [50]:
col1 = "12m_col1"
col2 = "12m_col2"
print("gb col1", df[[col1, col2]].groupby(col1).nunique().max())
print("gb col2", df[[col1, col2]].groupby(col2).nunique().max())
print(get_relation(df, col1, col2), ' reversed ', get_relation(df, col2, col1))

gb col1 12m_col2    3
dtype: int64
gb col2 12m_col1    1
dtype: int64
one-to-many  reversed  many-to-one

In [51]:
col1 = "m2m_col1"
col2 = "m2m_col2"
print("gb col1", df[[col1, col2]].groupby(col1).nunique().max())
print("gb col2", df[[col1, col2]].groupby(col2).nunique().max())
print(get_relation(df, col1, col2), ' reversed ', get_relation(df, col2, col1))

gb col1 m2m_col2    2
dtype: int64
gb col2 m2m_col1    3
dtype: int64
many-to-many  reversed  many-to-many